app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');

        // 1. Cek format header
        if (empty($authHeader) || !str_starts_with($authHeader, 'Bearer ')) {
            return $this->unauthorizedResponse();
        }

        $token = substr($authHeader, 7);

        // 2. Cek token di database
        $tokenModel = new MemberTokenModel();
        $tokenData = $tokenModel->where('auth_key', $token)->first();

        if (!$tokenData) {
            return $this->unauthorizedResponse();
        }

        // 3. Ambil data user berdasarkan member_id dari token
        $memberModel = new MemberModel();
        $user = $memberModel->find($tokenData['member_id']);
---
SELECT *
FROM `member_token`
WHERE `auth_key` = 'e8742cc03ad2f43b8ea77af5f4d21b126d3fa24aaa770e170c29ef7e275ced9a'
 LIMIT 1
SELECT *
FROM `member`
WHERE `member`.`id` = '3'