app/Controllers/AuthController.php

    public function login()
    {
        $modelMember = new MemberModel();
        $modelToken = new MemberTokenModel();

        // Ambil data JSON dari body request
        $data = $this->request->getJSON();

        // Validasi input
        if (!isset($data->email) || !isset($data->password)) {
            return $this->failResponse("Email dan password diperlukan", 400);
        }

        // 1. Cari user berdasarkan email
        $user = $modelMember->where('email', $data->email)->first();

        // 2. Verifikasi user dan password
        if (!$user || !password_verify($data->password, $user['password'])) {
            return $this->failResponse("Email atau password salah", 401);
        }

        // 3. Buat token
        $token = bin2hex(random_bytes(32));

        // 4. Simpan token ke database
        try {
            // Hapus token lama jika ada
            $modelToken->where('member_id', $user['id'])->delete();

            // Simpan token baru
            $modelToken->insert([
                'member_id' => $user['id'],
                'auth_key' => $token
            ]);
---
SELECT *
FROM `member`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
DELETE FROM `member_token`
WHERE `member_id` = '3'
INSERT INTO `member_token` (`member_id`, `auth_key`) VALUES ('3', 'a437ab369f667ee94936444f17be92f3d846d2d9780f7ea4415f9d81ed579a51')