app/Controllers/ProdukController.php

SELECT *
FROM `member_token`
WHERE `auth_key` = 'ca69dedaecf5e3aadeecdfa9ac6dddcc857a1121c197fc8c45b0ff0eeeebb6f7'
 LIMIT 1
---
    public function __construct()
    {
        $this->model = new ProdukModel();

        $request = service('request');
        $authHeader = $request->getHeaderLine('Authorization');

        // Default respons error 401
        $send401 = function($message) {
            $response = service('response');
            $response->setStatusCode(401)
                     ->setJSON(['status' => 401, 'message' => $message])
                     ->send();
            exit; // HENTIKAN EKSEKUSI CI4 SECARA PAKSA
        };

        if (empty($authHeader) || !str_starts_with($authHeader, 'Bearer ')) {
            // Token hilang atau format salah
            $send401('Token tidak ditemukan di header Authorization.');
        }

        $token = substr($authHeader, 7);
        $modelToken = new MemberTokenModel();

        // Cek token di database
        $found = $modelToken->where('auth_key', $token)->first();