app/Controllers/RegistrasiController.php

    public function create()
    {
        // Inisialisasi model
        $model = new MemberModel();

        // Mengambil data JSON mentah dari body request
        $data = $this->request->getJSON();

        // Validasi input sederhana
        if (!isset($data->nama) || !isset($data->email) || !isset($data->password)) {
            // Kirim respons error jika data tidak lengkap
            return $this->failResponse("Nama, email, dan password diperlukan", 400);
        }

        if (strlen($data->password) < 8) {
            return $this->failResponse("Password minimal 8 karakter", 400);
        }

        // Pengecekan duplikasi email
        // $model->where('email', $data->email)->first()
        // Artinya: "CARI di tabel member DIMANA email = $data->email, AMBIL data (first) baris pertama"
        if ($model->where('email', $data->email)->first()) {
            return $this->failResponse("Email sudah terdaftar", 400);
        }

        // Blok 'try...catch' untuk menangani error jika terjadi kegagalan saat insert DB
        try {
            // Memasukkan data ke database
            $model->insert([
                'nama' => $data->nama,
                'email' => $data->email,
                'password' => $data->password // Password mentah
                // Hashing akan otomatis ditangani oleh Model (callback beforeInsert)
            ]);
---
SELECT *
FROM `member`
WHERE `email` = 'ayam@gmail.com'
 LIMIT 1
INSERT INTO `member` (`nama`, `email`, `password`) VALUES ('ayam', 'ayam@gmail.com', '$2y$12$RpfCQXCkRfHs2gdk/SiHSOrz5j5LAkuSKoiRmVrlaBC1bgnE6nxti')