app/Controllers/ResepController.php

        public function saved($userId = null)
        {
            if (!$userId) {
                return $this->fail('User ID diperlukan.', 400);
            }

            $savedModel = new \App\Models\SavedRecipeModel();
            $savedRows = $savedModel
                ->where('saved_recipes.user_id', $userId)
                ->orderBy('saved_recipes.created_at', 'DESC')
                ->findAll();

            $base = rtrim(base_url(), '/');
            $mapped = [];

            foreach ($savedRows as $row) {
                $recipeId = isset($row['recipe_id']) ? $row['recipe_id'] : null;
                if (!$recipeId) continue;

                // Ambil seluruh detail resep agar sama persis seperti detail view
                $recipe = $this->model->find($recipeId);
---
SELECT *
FROM `recipes`
WHERE `recipes`.`id` = 'user'