app/Controllers/ResepController.php

SELECT *
FROM `saved_recipes`
WHERE `saved_recipes`.`user_id` = '3'
ORDER BY `saved_recipes`.`created_at` DESC
---
        $savedRecipeModel = new \App\Models\SavedRecipeModel();

        // Cek apakah sudah ada di saved_recipes
        $existing = $savedRecipeModel->where([
            'user_id' => $currentUserId,
            'recipe_id' => $recipeId
        ])->first();